/**
 * 配置
 */
var CONFIG = {
  //【控制器】移动速度
  movementSpeed: 1,
  //【控制器】旋转速度
  rollSpeed: Math.PI / 12,
  //【控制器】奔跑的速度
  movementSpeedMultiplier: 1.0,
  //【控制器】是否鼠标按下才开始旋转视角
  dragToLook: true,
  //【控制器】自动前进
  autoForward: false,

  // 相机的初始位置和初始角度
  cameraOptions: {
    // 默认的位置和角度
    default: {
      // 打开浏览器控制台，输入：gCamera.position.toArray()，直接复制结果
      position: [-0.10462288529115646, -0.007084388584290962, 0.003724369367013562],
      // 打开浏览器控制台，输入：gCamera.rotation.toArray()
      rotation: [-1.7362318168992519, -1.0590688652209677, -1.7507624493818552, 'XYZ'],
    },
    // “air” 资源的位置和角度
    air: {
      position: [-1.0, 0.7, 0.0],
      rotation: [0.0, 0.0, 0.0],
    },
    gongyuan: {
      position: [-0.11539788268317955, 0.41815891033489583, -0.978648043958824],
      rotation: [-2.2394493856376427, -0.22597217655178034, -2.959666209599899, 'XYZ'],
    },
    zgkeda: {
      position: [0.41632078923336857, 0.42499184721804817, -1.0425062856030913],
      rotation: [-2.3152653381720256, 0.1908867485056652, 2.771682135877941, 'XYZ'],
    }
  },

  // 网格大小
  occupancyGridBlockSizes: {
    default: [8, 16, 32, 64, 128],
    air: [16, 32, 64, 128, 256],
  },
};
